In [2]:
import pandas as pd
import calendar

In [58]:
data=pd.read_csv('crime_clean.csv',index_col=0)
data.head()

,TYPE,YEAR,MONTH,DAY,HOUR,MINUTE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude,DATE
0,Other Theft,2003,5,12,16.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-12
1,Other Theft,2003,5,7,15.0,20.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-07
2,Other Theft,2003,4,23,16.0,40.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-23
3,Other Theft,2003,4,20,11.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-20
4,Other Theft,2003,4,12,17.0,45.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-12

In [16]:
date_df=data[['DATE']]
date_df=date_df.drop_duplicates()
date_df['DATE']=pd.to_datetime(date_df['DATE']).astype('datetime64[ns]')
date_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5308 entries, 0 to 514245
Data columns (total 1 columns):
DATE    5308 non-null datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 82.9 KB

In [17]:
date_df.head()

        DATE
0 2003-05-12
1 2003-05-07
2 2003-04-23
3 2003-04-20
4 2003-04-12

In [18]:
date_df['day_of_week'] = date_df['DATE'].dt.day_name()
date_df.head()

        DATE day_of_week
0 2003-05-12      Monday
1 2003-05-07   Wednesday
2 2003-04-23   Wednesday
3 2003-04-20      Sunday
4 2003-04-12    Saturday

In [24]:
date_df['Month'] = data['MONTH'].apply(lambda x: calendar.month_name[x])

In [25]:
date_df.head()

        DATE day_of_week  Month
0 2003-05-12      Monday    May
1 2003-05-07   Wednesday    May
2 2003-04-23   Wednesday  April
3 2003-04-20      Sunday  April
4 2003-04-12    Saturday  April

In [26]:
date_df.to_csv("days_of_week.csv")

In [59]:
data.head()

,TYPE,YEAR,MONTH,DAY,HOUR,MINUTE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude,DATE
0,Other Theft,2003,5,12,16.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-12
1,Other Theft,2003,5,7,15.0,20.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-07
2,Other Theft,2003,4,23,16.0,40.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-23
3,Other Theft,2003,4,20,11.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-20
4,Other Theft,2003,4,12,17.0,45.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-12

In [60]:
data['crime_count']=1
data.head()

,TYPE,YEAR,MONTH,DAY,HOUR,MINUTE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude,DATE,crime_count
0,Other Theft,2003,5,12,16.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-12,1
1,Other Theft,2003,5,7,15.0,20.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-07,1
2,Other Theft,2003,4,23,16.0,40.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-23,1
3,Other Theft,2003,4,20,11.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-20,1
4,Other Theft,2003,4,12,17.0,45.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-12,1

In [62]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 469721 entries, 0 to 530651
Data columns (total 14 columns):
TYPE             469721 non-null object
YEAR             469721 non-null int64
MONTH            469721 non-null int64
DAY              469721 non-null int64
HOUR             469721 non-null float64
MINUTE           469721 non-null float64
HUNDRED_BLOCK    469708 non-null object
NEIGHBOURHOOD    469721 non-null object
X                469721 non-null float64
Y                469721 non-null float64
Latitude         469721 non-null float64
Longitude        469721 non-null float64
DATE             469721 non-null object
crime_count      469721 non-null int64
dtypes: float64(6), int64(4), object(4)
memory usage: 53.8+ MB

In [68]:
year_2016=pd.read_csv("../2016_demographics.csv")
year_2016.head()

,neighbourhood,total_population,age_mean,age_median,household_size,income_mean,income_median,over_100k_pct,lowincome_pct,unemployment,income_over30_pct,shelter_median,shelter_mean,dwelling_median,dwelling_mean,subsidized_pct,year
0,Arbutus-Ridge,15295,44.6,46.2,2.4,62675,30929,14.121511,24.4,6.6,39.0,1316,2241,2505285,2500033,9.3,2016
1,Downtown,62030,40.6,37.1,1.7,63251,41858,16.017155,23.8,5.6,36.6,1675,1880,697128,941493,19.0,2016
2,Dunbar-Southlands,21425,41.1,44.1,2.8,78117,40463,21.060515,15.9,6.2,28.7,1255,2324,3004627,3026785,3.7,2016
3,Fairview,33620,43.4,40.2,1.7,61627,46940,13.842522,14.7,4.6,23.5,1238,1497,648593,761230,9.6,2016
4,Grandview-Woodland,29175,40.2,38.1,1.9,42896,32438,6.860625,20.5,5.3,22.3,1323,1555,880109,899002,22.3,2016

In [70]:
year_2016=year_2016.melt(id_vars =['neighbourhood','year'])

In [72]:
year_2016.to_csv('2016_demographics_stacked.csv')